29	All Saints	Aflevering 17 (jaargang 11) van de Australische ziekenhuisreeks.
72	Aspe	Aflevering 10 (jaargang 9) van de Vlaamse misdaadserie die zich situeert in Brugge.
39	Blind Getrouwd - Australië	Aflevering 20 (jaargang 4) van de Australische realityreeks waarin een team van deskundigen singles aan elkaar koppelt, die met elkaar trouwen en daarna zeker een maand lang moeten samenleven.
65	Blind Getrouwd - Australië	Aflevering 21 (jaargang 4) van de Australische realityreeks waarin een team van deskundigen singles aan elkaar koppelt, die met elkaar trouwen en daarna zeker een maand lang moeten samenleven.
63	Border Security Canada	Aflevering 13 (jaargang 2) van de realityreeks over het gevarieerde werk van douaniers en grensagenten in Canada.
46	Border Security Canada	Aflevering 12 (jaargang 2) van de realityreeks over het gevarieerde werk van douaniers en grensagenten in Canada.
74	Chicago PD	Aflevering 15 (jaargang 3) van het Amerikaanse politiedrama over de mannen en vrouwen van District 21 van het Chicago Police Department.
30	De Avonturen van K3	Animatiereeks waarin de meiden van K3 op avontuur trekken. Met de stemmen van Hanne, Marthe en Klaasje.
101	De Buurtpolitie - Extra	Koen en Tineke van De Buurtpolitie praten tijdens hun koffiepauze over ditjes en datjes en mijmeren samen over hun gekste, grappigste of spannendste avonturen.
27	De Buurtpolitie - Extra	Koen en Tineke van De Buurtpolitie praten tijdens hun koffiepauze over ditjes en datjes en mijmeren samen over hun gekste, grappigste of spannendste avonturen.
59	De Rodenburgs	Aflevering 7 (seizoen 2) van de Vlaamse dramareeks.
58	Dinner Date	Aflevering 24 (jaargang 7) van het Britse datingprogramma waarin een vrijgezel drie dates uitkiest aan de hand van hun zelf opgesteld menu. Presentatie: Charlotte Hudson.
43	Dinner Date	Aflevering 23 (jaargang 7) van het Britse datingprogramma waarin een vrijgezel drie dates uitkiest aan de hand van hun zelf opgesteld menu. Presentatie: Charlotte Hudson.
42	Don't Tell The Bride - Ireland 	Aflevering 7 (jaargang 3) van de Ierse realityreeks waarin aanstaande bruiden de organisatie van hun huwelijk uit handen geven aan hun bruidegom.
56	Don't Tell The Bride - Ireland 	Aflevering 1 (jaargang 4) van de Ierse realityreeks waarin aanstaande bruiden de organisatie van hun huwelijk uit handen geven aan hun bruidegom.
85	Dr. Oz Show	Aflevering (jaargang 4) van de medische talkshow met gastheer Dr. Mehmet Oz.
64	Echte Verhalen: De Kliniek	Aflevering 26 van de Vlaamse scripted realityserie waarin bijzondere ziekenhuisverhalen centraal staan.
44	Echte Verhalen: De Kliniek	Aflevering 25 van de Vlaamse scripted realityserie waarin bijzondere ziekenhuisverhalen centraal staan.
50	Familie	Aflevering 4909 van de Vlaamse dagelijkse serie over het wel en wee van de familie Van den Bossche en hun entourage.
19	Familie seizoen 27 aflevering 214	...
37	Geen Uitzending
25	Heart of the Country	Romantisch drama uit 2013 van John Ward.
21	Het Weer
34	Home: Avonturen met Tip & Oh	Animatiereeks over de alien Oh, die intrekt bij Tip en haar familie.
45	House Rules	Aflevering 33 (jaargang 2) van de Australische realityreeks.
67	Ik Vertrek	Aflevering 6 (jaargang 8) van de Nederlandse reeks rond gezinnen die hun geluk in het buitenland beproeven.
87	Kabouter Plop	Kabouterverhalen voor de allerkleinsten.
24	Last Man Standing	Aflevering 15 (jaargang 6) van de Amerikaanse komediereeks.
36	Lexie & Lotti	Aflevering 7 over de tweelingzusjes Lexie en Lotti, die als rasechte detectives alle misdaden in hun stad oplossen.
69	Lili en Marleen	Aflevering 3 (jaargang 2) van de Vlaamse serie over de bewoners van 'De Lichttoren'.
54	Love It or List It	Aflevering van de Canadese realityshow over families die ontevreden zijn over hun huis. Designer Hilary Farr probeert hen te overtuigen om het huis op te knappen, makelaar David Visenti zoekt een ander, beter pand. Wat zullen de families doen: verbouwen of verhuizen?
94	Maya de Bij	Aflevering van de 3D-animatiereeks over het nieuwsgierige bijtje Maya en haar kompanen.
102	Met Vier in Bed	Vier duo's verblijven een dag en een nacht in elkaars B&B en geven een beoordeling. Ieder koppel vertaalt zijn appreciatie in de vorm van bedjes, die worden uitgedeeld op een schaal van 1 tot 5. De B&B die het grootste aantal bedjes in de wacht sleept, wordt uitgeroepen tot winnaar van de week.
70	Miljonair	Staf Coppens host een nieuwe versie van de legendarische quiz Wie Wordt Euromiljonair?. Elke aflevering maken 6 nieuwe kandidaten kans op de prijzenpot van 1 miljoen euro, door het juiste antwoord op de meerkeuzevragen te geven.
73	Million Pound Properties	Documentairereeks over de vastgoedmarkt in de UK.
83	My Kitchen Rules	Aflevering 32 (jaargang 6) van de Australische realityreeks waarin gestreden wordt om de titel van beste thuiskok.
20	Newlyweds, the First Year	Aflevering 10 (jaargang 3) van de realityreeks die toont hoe vier koppels het eerste jaar van hun huwelijk beleven.
91	PopPixie	Animatieserie over de Pixies, elfjes en gnomen die in Elfenstad wonen.
47	Project Runway	Aflevering 10 (jaargang 13) van de Amerikaanse reeks waarin 16 getalenteerde en gedreven modeontwerpers het tegen mekaar opnemen. De inzet is het uitbrengen van een eigen collectie. Presentatie: Heidi Klum en Tim Gunn.
40	Qmusic
71	Remember Sunday	Romantisch drama uit 2013 van Jeff Bleckner
88	Robocar Poli	Het Robocar team bestaat uit een geweldig groepje hulpvoertuigen die altijd klaarstaan om buren en vrienden in Bezenstad te redden uit gevaarlijke situaties.
76	Royal Pains	Aflevering 8 (seizoen 3) van de Amerikaanse dramedy-reeks van Andrew Lencewski en John P. Rogers.
53	Speechless	Aflevering 8 (seizoen 1) van de Amerikaanse komische reeks.
52	Spoed	Aflevering 5 (jaargang 9) van de Vlaamse ziekenhuisserie.
55	Strong Medicine	Aflevering 2 (jaargang 2) van de Amerikaanse ziekenhuisserie.
99	Sturm der Liebe	Aflevering 2596 van de Duitse soapserie rond de familie Saalfeld en het personeel van het Fürstenhof.
26	Sturm der Liebe	Aflevering 2595 van de Duitse soapserie rond de familie Saalfeld en het personeel van het Fürstenhof.
90	Super Wings	Het rode vliegtuig Jett bezorgt pakketjes aan kinderen over de hele wereld. Tijdens zijn reizen komt Jett onvoorziene uitdagingen tegen, die hij samen met het Super Wings Team oplost.
98	Talking Tom and Friends	Talking Tom en zijn vrienden willen koste wat kost beroemd worden. Ze doen er dan ook alles aan om echte supersterren te worden, maar hun plannen lopen vaak in het honderd.
51	The Good Mistress	Amerikaanse Thriller van Terry Ingram uit 2014
23	The Guardian	Aflevering 16 (jaargang 2) van de Amerikaanse dramareeks rond advocaat Nick Fallin.
92	Thomas de Trein	Aflevering 1 (seizoen 19) van de Britse animatiereeks over Thomas de Trein en zijn vrienden.
57	Til Death	Aflevering 1 (jaargang 4) van de Amerikaanse sitcom.
100	Trollenjagers: Verhalen uit Arcadia	Animatiereeks uit 2016 van Guillermo del Toro waarin Jim, een doodgewone jongen, een mysterieus amulet vindt en plots beschermer wordt van twee werelden.
1	Video context title 1
10	Video context title 10
11	Video context title 11
12	Video context title 12
13	Video context title 13
14	Video context title 14
15	Video context title 15
16	Video context title 16
17	Video context title 17
18	Video context title 18
2	Video context title 2
3	Video context title 3
4	Video context title 4
5	Video context title 5
6	Video context title 6
7	Video context title 7
8	Video context title 8
9	Video context title 9
22	Virtually in Love	Aflevering 7 (Seizoen 1) van de Amerikaanse realityserie uit 2015 over online daten.
28	VLOGLAB Compilatie	In Vloglab krijgen acht ervaren en minder ervaren vloggers de kans om de VTMKZOOM- en KADET-kijkers mee te nemen in hun creatieve wereld. Ze maken persoonlijke video's over hun hobby's, huisdieren en passies.
66	VTM NIEUWS	Nieuws van de dag met achtergrondinformatie, gevolgd door uitgebreide sportverslaggeving. Presentatie: Stef Wauters, Dany Verstraeten, Birgit Van Mol, Elke Pattyn of Freek Braeckman.
38	Wendy	Aflevering 26 van de animatiereeks over de 15-jarige Wendy en haar buitengewone leven op de manege.
97	Zeppe & Zikki	Aflevering 2 (jaargang 5) van de animatie- en poppenspelreeks voor meer verkeersveiligheid.
96	Zeppe & Zikki	Aflevering 1 (jaargang 5) van de animatie- en poppenspelreeks voor meer verkeersveiligheid.
